app/Http/Controllers/AccessController.php

    public function signin(Request $request)
    {
        $checkPassword = new CurrentPassword;
        $checkPassword->setData($request->only('email'));

        $request->validate([
            'email' => ['required', 'email'],
            'password' => ['required', 'string', $checkPassword]
        ]);

        $user = User::where('email', $request->only('email'))->first();
---
select * from `users` where `email` = 'zhenya091992@gmail.com' limit 1