app/Http/Controllers/AccountController.php

    public function list()
    {
        $records = DB::table('source_data')->where('idUser', '=', Auth::user()->id)->get();
---
select * from `source_data` where `source_data`.`idUser` = 1 and `source_data`.`idUser` is not null